//6. На детска площадка трябва да се поставят плочки.Площадката е с форма на квадрат със страна N метра.Плочките са широки „W“ метра и дълги „L“ метра.На площадката има една пейка с ширина M метра и дължина O метра.Под нея не е нужно да се слагат плочки.Всяка плочка се поставя за 0.2 минути.
//Напишете програма, която чете от конзолата размерите на площадката, плочките и пейката и пресмята колко плочки са необходими да се покрие площадката и пресмята времето за поставяне на всички плочки.
//Пример: площадка с размер 20м.има площ 400кв.м.Пейка широка 1м.и дълга 2м., заема площ 2кв.м.Една плочка е широка 5м.и дълга 4м.има площ = 20кв.м.Площта която трябва да се покрие е 400 – 2 = 398 кв.м.Необходими са 398 / 20 = 19.90 плочки.Необходимото време е 19.90 * 0.2 = 3.98 минути.
//От конзолата се четат 5 числа:
//•	N – дължината на страна от площадката в интервала[1...100]
//•	W – широчината на една плочка в интервала [0.1...10.00]
//•	L – дължината на една плочка в интервала [0.1...10.00]
//•	М – широчината на пейката в интервала[0...10]
//•	О – дължината на пейката в интервала[0...10]
//Да се отпечата на конзолата две числа: броят плочки необходи за ремонта и времето за поставяне.


using System;
using System.Collections.Generic;

namespace _6.KidsPlayground
{
    class Program
    {
        static void Main(string[] args)
        {
            int inputCount = 0;
            var inputList = new List<double>();

            while (inputCount < 5)
            {
                double userInput = Double.Parse(Console.ReadLine());
                inputList.Add(userInput);
                inputCount++;
            }

            double totalPlayGroundArea = (inputList[0] * inputList[0]) - (inputList[3] * inputList[4]);
            double tilesCount = totalPlayGroundArea / (inputList[1] * inputList[2]);
            Console.WriteLine("Необходими са: {0:0.00} плочки.", tilesCount);
            Console.WriteLine("Необходимото време е: {0:0.00}.", tilesCount * 0.2);
        }
    }
}
